Repository: 1byte2bytes/bison
Catalog: po/*.po
Languages: hr

source: too many states (max %d)
hr: previ¹e stanja (maks %d)

source: Unknown system error
hr: Nepoznata sistemska gre¹ka

source: warning:
hr: upozorenje:

source: fatal error:
hr: fatalna gre¹ka:

source: Conflict in state %d between rule %d and token %s resolved as %s.
hr: Konflikt u stanju %d izmeðu pravila %d i znaka %s razrije¹en kao %s.

source: reduce
hr: reduciraj

source: shift
hr: pomakni

source: an error
hr: gre¹ka

source: %d shift/reduce conflict
hr: %d pomakni/reduciraj konflikat

source: and
hr: i

source: %d reduce/reduce conflict
hr: %d reduciraj/reduciraj konflikt

source: State %d contains
hr: Stanje %d sadr¾i

source: conflicts:
hr: konflikt:

source: %d shift/reduce
hr: %d pomakni/reduciraj

source: %d reduce/reduce
hr: %d reduviraj/reduciraj

source: %s contains
hr: %s sadr¾i

source: expected %d shift/reduce conflict
hr: oèekujem %d pomakni/reduciraj konflikt

source: cannot open file `%s'
hr: ne mogu otvoriti datoteku `%s'

source: cannot close file
hr: ne mogu zatvoriti datoteku

source: GNU bison generates parsers for LALR(1) grammars.
hr: GNU bison generira parsere za LALR(1) gramatike.

source: Usage: %s [OPTION]... FILE
hr: Kori¹tenje: %s [OPCIJA]... DATOTEKA

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
hr: Ako duga opcija ka¾e da je argument obavezan, tada je on obavezan i za ekvivalentnu kratku opciju. Slièno je i za opcionalne argumente.

source: Operation modes: -h, --help display this help and exit -V, --version output version information and exit -y, --yacc emulate POSIX yacc
hr: Naèini rada: -h, --help prika¾i ovu pomoæ i izaði -V, --version prika¾i verziju i izaði -y, --yacc emuliraj POSIX yacc

source: Parser: -S, --skeleton=FILE specify the skeleton to use -t, --debug instrument the parser for debugging --locations enable locations computation -p, --name-prefix=PREFIX prepend PREFIX to the external symbols -l, --no-lines don't generate `#line' directives -n, --no-parser generate the tables only -k, --token-table include a table of token names
hr: Parser: -S, --skeleton=DATOTEKA specificiraj kostur za uporabu -t, --debug pripremi parser za deugiranje --locations omoguæi izraèunavanje lokacija -p, --name-prefix=PREFIKS stavi PREFIX ispred vanjskih simbola -l, --no-lines ne eneriraj `#line' direktive -n, --no-parser generiraj samo tablice -k, --token-table ukljuèi tablicu imena znakova

source: Output: -d, --defines also produce a header file -v, --verbose also produce an explanation of the automaton -b, --file-prefix=PREFIX specify a PREFIX for output files -o, --output=FILE leave output to FILE -g, --graph also produce a VCG description of the automaton
hr: Izlaz: -d, --defines takoðer proizvedi header datoteku -v, --verbose takoðer proizvedi obja¹njenje automata -b, --file-prefix=PREFIKS specificiraj PREFIKS za izlazne datoteke -o, --output=DATOTEKA ispi¹i izlaz u DATOTEKU -g, --graph takoðer proizvedi VCG opis automata

source: Report bugs to <bug-bison@gnu.org>.
hr: Izvjesti o bugovima na <bug-bison@gnu.org>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
hr: Ovo je slobodni softver; pogledajte kod kako biste doznali uvjete kopiranja. NEMA garancije; èak ni tvrdnje o ISPLATIVOSTI ili POGODNOSTI ZA NEKU SVRHU.

source: `%s' is no longer supported
hr: `%s' vi¹e nije podr¾ano

source: Try `%s --help' for more information.
hr: Poku¹aj `%s --help' za vi¹e informacija.

source: %s: no grammar file given
hr: %s: nije data datoteka sa gramatikom

source: %s: extra arguments ignored after `%s'
hr: %s: dodatni argumenti se ignoriraju nakon `%s'

source: too many gotos (max %d)
hr: previ¹e goto-a (maksimalno %d)

source: unexpected `/' found and ignored
hr: neoèekivan `/' naðen i zanemaren

source: unterminated comment
hr: nezavr¹eni komentar

source: unexpected end of file
hr: neoèekivan kraj datoteke

source: unescaped newline in constant
hr: neoèekivan znak za novu liniju u konstanti

source: octal value outside range 0...255: `\%o'
hr: oktalna vrijednost izvan dosega 0...255: `\%o'

source: hexadecimal value above 255: `\x%x'
hr: heksadecimalna vrijednost vi¹a od 255: `\x%x'

source: unknown escape sequence: `\' followed by `%s'
hr: nepoznata escape sekvenca: `\' koju slijedi `%s'

source: unterminated type name at end of file
hr: nezavr¹eno ime tipa pri kraju datoteke

source: unterminated type name
hr: nezavr¹eno ime tipa

source: use "..." for multi-character literal tokens
hr: koristi "..." za vi¹ebajtne znakove

source: `%s' supports no argument: %s
hr: `%s' ne podr¾ava argument: %s

source: `%s' requires an argument
hr: `%s' zahtijeva argument

source: type %d is %s
hr: tip %d je %s

source: (rule %d)
hr: (pravilo %d)

source: %-4s shift, and go to state %d
hr: %-4s pomakni i idi u stanje %d

source: %-4s error (nonassociative)
hr: %-4s gre¹ka (nonassociative)

source: %-4s go to state %d
hr: %-4s idu u stanje %d

source: $default reduce using rule %d (%s)
hr: $default reduciraj koristeæi pravilo %d (%s)

source: %-4s [reduce using rule %d (%s)]
hr: %-4s [reduciraj koristeæi pravilo %d (%s)]

source: %-4s reduce using rule %d (%s)
hr: %-4s reduciraj koristeæi pravilo %d (%s)

source: $default reduce using rule %d (%s)
hr: $default reduciraj koristeæi pravilo %d (%s)

source: $default accept
hr: $default prihvati

source: NO ACTIONS
hr: NEMA AKCIJA

source: state %d
hr: stanje %d

source: Grammar
hr: Gramatika

source: Number, Line, Rule
hr: Broj, Linija, Pravilo

source: empty
hr: prazno

source: Terminals, with rules where they appear
hr: Zavr¹ni znakovi, sa pravilima gdje se pojavljuju

source: Nonterminals, with rules where they appear
hr: Nezavr¹ni znakovi, sa pravilima gdje se pojavljuju

source: on left:
hr: s lijeva:

source: on right:
hr: s desna:

source: symbol %s is used, but is not defined as a token and has no rules
hr: simbol %s je kori¹ten, ali nije definiran kao znak i nema pravila

source: symbol `%s' used more than once as a literal string
hr: simbol `%s' kori¹ten vi¹e puta kao znakovni niz

source: symbol `%s' given more than one literal string
hr: simbolz `%s' dat vi¹e od jednog znakovnog niza

source: conflicting precedences for %s and %s
hr: konflikt u prethodnici za %s and %s

source: conflicting assoc values for %s and %s
hr: konfliktne asocijativne vrijednosti za %s i %s

source: tokens %s and %s both assigned number %d
hr: objema znakovima %s i %s je pridru¾en broj %d

source: Skipping to next \n
hr: Preskaèem na slijedeæe \n

source: Skipping to next %c
hr: Preskaèem na slijedeæi %c

source: invalid $ value
hr: nedozvoljena $ vrijednost

source: unterminated string at end of file
hr: nezavr¹eni znakovni niz na kraju datoteke

source: unterminated string
hr: nezavr¹eni znakovni niz

source: %s is invalid
hr: %s je nedozvoljeno

source: $$ of `%s' has no declared type
hr: $$ od `%s' nema deklarirani tip

source: $%d of `%s' has no declared type
hr: $%d od `%s' nema deklarirani tip

source: unterminated `%{' definition
hr: nezavr¹ena `%{' definicija

source: Premature EOF after %s
hr: Preuranjeni EOF nakon %s

source: symbol %s redefined
hr: simbol %s ponovo definiran

source: type redeclaration for %s
hr: ponovna deklaracija za %s

source: `%s' is invalid in %s
hr: `%s' je nedozvoljen u %s

source: multiple %s declarations
hr: vi¹estruke %s deklaracije

source: invalid %s declaration
hr: nedozvoljena %s deklaracija

source: %type declaration has no <typename>
hr: %type deklaracija nema <typename>

source: invalid %%type declaration due to item: %s
hr: nedozvoljena %%type deklaracija zbog: %s

source: redefining precedence of %s
hr: ponovno definiran prethodnik od %s

source: invalid text (%s) - number should be after identifier
hr: nedozvoljeno tekst (%s) - broj bi trebao biti nakon identifikatora

source: unexpected item: %s
hr: neoèekivani: %s

source: unmatched %s
hr: nije pronaðen %s

source: argument of %%expect is not an integer
hr: argument od %%expect nije cijeli broj

source: unrecognized item %s, expected an identifier
hr: neprepoznati %s, oèekivan nakon identifikatora

source: expected string constant instead of %s
hr: oèekivana znakovna konstana umjesto %s

source: unrecognized: %s
hr: neprepoznati: %s

source: no input grammar
hr: nema ulazne gramatike

source: unknown character: %s
hr: nepoznati znak: %s

source: ill-formed rule: initial symbol not followed by colon
hr: lo¹e pravilo: zarez ne bi trebao slijediti poèetni simbol

source: grammar starts with vertical bar
hr: gramatika poèinje sa okomitom crtom

source: rule given for %s, which is a token
hr: pravilo dato za %s, a to je znak

source: previous rule lacks an ending `;'
hr: prethodnom pravilu nedostaje zavr¹etak `;'

source: two @prec's in a row
hr: dva @prec's u retku

source: two actions at end of one rule
hr: dvije akcije pri kraju jednog pravila

source: type clash (`%s' `%s') on default action
hr: sudar tipova (`%s' `%s') na deaultnoj akciji

source: empty rule for typed nonterminal, and no action
hr: prazno pravilo za nezavr¹ni znak, i nema akcije

source: invalid input: %s
hr: nedozvoljeni ulaz: %s

source: no rules in the input grammar
hr: nema pravila u ulaznoj gramatici

source: too many symbols (tokens plus nonterminals); maximum %d
hr: previ¹e simbola (znakovi plus nezavr¹ni znakovi); maksimalno %d

source: the start symbol %s is undefined
hr: poèetni simbol %s nije definiran

source: the start symbol %s is a token
hr: poèetni simbol %s je znak

source: Useless nonterminals:
hr: Beskorisni nezavr¹ni znakovi:

source: Terminals which are not used:
hr: Zavr¹ni znakovi koji nisu kori¹teni:

source: Useless rules:
hr: Beskorisna pravila:

source: %d rule never reduced
hr: %d pravilo nije nikad reducirano

source: %d useless nonterminal
hr: %d beskorisan nezavr¹ni znak

source: and
hr: i

source: %d useless rule
hr: %d beskorisno pravilo

source: Start symbol %s does not derive any sentence
hr: Poèetni simbol %s ne daje niti jednu reèenicu

source: %s: option `%s' is ambiguous
hr: %s: opcija `%s' je nejednoznaèna

source: %s: option `--%s' doesn't allow an argument
hr: %s: opcija `--%s' ne dopu¹ta argument

source: %s: option `%c%s' doesn't allow an argument
hr: %s: opcija `%c%s' ne dopu¹ta argument

source: %s: option `%s' requires an argument
hr: %s: opcija `%s' zahtijeva argument

source: %s: unrecognized option `--%s'
hr: %s: neprepoznata opcija `--%s'

source: %s: unrecognized option `%c%s'
hr: %s: neprepoznata opcija `%c%s'

source: %s: illegal option -- %c
hr: %s: nedozvoljena opcija -- %c

source: %s: invalid option -- %c
hr: %s: nedozvoljena opcija -- %c

source: %s: option requires an argument -- %c
hr: %s: opcija zahtijeva argument -- %c

source: %s: option `-W %s' is ambiguous
hr: %s: opcija `-W %s' je nejednoznaèna

source: %s: option `-W %s' doesn't allow an argument
hr: %s: opcija `-W %s' ne dopu¹ta argument

source: memory exhausted
hr: iscrpljeni memorijski resursi
